"use client";

import React from "react";
import MyFooter from "@/components/MyFooter";
import MyNavbar from "@/components/MyNavbar";

const AboutUsPage = () => {
  return (
    <>
      <MyNavbar />
      <div className="min-h-screen bg-neutral-200 text-black py-10">
        <div className="container mx-auto px-4">
          <div className="bg-white p-7 rounded-lg shadow-lg">
            <h1 className="text-4xl font-bold text-orange-500 pt-3 mb-6 text-center">
              За нас
            </h1>
            <h1 className="text-zinc-900 p-4 rounded-lg text-2xl font-bold mb-2">
              Кои сме ние:{" "}
            </h1>
            <div className="space-y-6 text-lg">
              <p>
                Добре дошли в нашия уебсайт! Ние сме Българската Федерация по
                Радиоориентиране (БФРА), която обединява любители и
                професионалисти в областта на спортното радиоориентиране и
                радиозасичането. Създадена с цел популяризиране и развитие на
                тези спортове в България, БФРА активно организира състезания,
                тренировки и събития, насочени към всички възрасти и нива на
                опит. Ние работим заедно със световни и европейски организации,
                за да осигурим качествено обучение и възможности за развитие на
                участниците.
              </p>
              <h1 className="text-zinc-900 p-2 rounded-lg text-2xl font-bold mb-2">
                Какво правим:{" "}
              </h1>
              <ul className="list-disc pl-6 space-y-2">
                <li>
                  Организираме и провеждаме състезания по радиоориентиране на
                  различни нива – от местни до международни.
                </li>
                <li>
                  Осигуряваме обучение за начинаещи и напреднали в спортните
                  дисциплини.
                </li>
                <li>
                  Сътрудничим с международни организации за обмен на опит и
                  развитие на спортните стандарти.
                </li>
              </ul>

              <h1 className="text-zinc-900 p-2 rounded-lg text-2xl font-bold mb-2">
                Нашата мисия:{" "}
              </h1>
              <p>
                Ние се стремим да създадем платформата, която да подпомага
                развитието на спорта по радиоориентиране и радиозасичане в
                България. Наша основна цел е да предоставим на любителите и
                професионалистите в тези дисциплини най-добрите условия за
                тренировки и участие в състезания, както и да разширим общността
                на спортуващите.
              </p>
              <div className="text-zinc-900 p-4 rounded-lg">
                <h1 className="text-2xl font-bold mb-2">Цели на сайта</h1>
                <ul className="list-disc pl-6 space-y-2">
                  <li>
                    Обучение и информираност: Сайтът може да предоставя
                    информация и ресурси за новаците и опитните състезатели,
                    включително ръководства за използване на оборудване, карти,
                    както и съвети за стратегически подходи.
                  </li>
                  <li>
                    Управление на състезания: Чрез лесни за използване онлайн
                    системи сайтът може да предоставя платформи за регистрация
                    на състезатели, създаване на графици, както и следене на
                    резултати в реално време.
                  </li>
                  <li>
                    Резултати и анализи: Публикуване на резултати от състезания
                    и статистики, които могат да бъдат полезни за проследяване
                    на напредъка на участниците и подготовката за бъдещи
                    състезания.
                  </li>
                </ul>
              </div>
              <h1 className="text-zinc-900 p-4 rounded-lg text-2xl font-bold mb-2">
                Защо да се присъедините към нас:{" "}
              </h1>
              <p>
                Присъединявайки се към нашата федерация, вие ставате част от
                динамична общност, която активно развива спортовете по
                радиоориентиране и радиозасичане в България. Ние предоставяме
                необходимите ресурси, подкрепа и възможности за участие в
                състезания и тренировки, както и за развитие на вашите умения и
                знания. С нашия сайт ние се стремим да създадем лесен за
                ползване портал за организиране на състезания, както и място,
                където всеки може да открие информация за събития, новини и
                постижения в спорта по радиоориентиране и радиозасичане.
              </p>
              <p>
                Благодарим ви, че отделихте време да научите повече за нас. Ако
                имате въпроси или искате да работите с нас, не се колебайте да
                се свържете с нас!
              </p>

              <div className="text-center mt-8">
                <a
                  href="/ardf"
                  className="bg-orange-500 ml-5 hover:bg-orange-600 text-white px-6 py-3 rounded-lg transition"
                >
                  Какво е ARDF
                </a>
                <a
                  href="/ardf"
                  className="bg-orange-500 ml-5 hover:bg-orange-600 text-white px-6 py-3 rounded-lg transition"
                >
                  Запиши се за състезание
                </a>
              </div>
            </div>
          </div>
        </div>
      </div>
      <MyFooter />
    </>
  );
};

export default AboutUsPage;
